tap "aws/tap"
tap "dart-lang/dart"
tap "dbt-labs/dbt"
tap "heroku/brew"
tap "homebrew/services"
tap "leoafarias/fvm"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "aom"
brew "certifi"
brew "pycparser"
brew "cffi"
brew "aws-sam-cli", link: false
brew "awscli"
brew "glib"
brew "cairo"
brew "chezmoi"
brew "docker", link: false
brew "docutils"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "envchain"
brew "harfbuzz"
brew "openjpeg"
brew "libass"
brew "libbluray"
brew "pango"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "open-mpi"
brew "fftw"
brew "gawk"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "jasper"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "guile"
brew "hdf5"
brew "hunspell"
brew "shared-mime-info"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "libgsf"
brew "libmatio"
brew "maven"
brew "mysql", restart_service: :changed
brew "mysql@8.4"
brew "numpy"
brew "ollama"
brew "openslide"
brew "openssl@1.1"
brew "pipenv"
brew "pnpm"
brew "poppler"
brew "postgresql@14"
brew "postgresql@15"
brew "protobuf@3"
brew "python@3.10"
brew "python@3.11"
brew "python@3.8"
brew "python@3.9"
brew "qt"
brew "r"
brew "starship"
brew "subversion"
brew "tig"
brew "uv"
brew "vips"
brew "yarn"
brew "heroku/brew/heroku"
brew "leoafarias/fvm/fvm"
cask "adobe-acrobat-reader"
cask "android-studio"
cask "chromium"
cask "cursor"
cask "docker-desktop"
cask "expo-orbit"
cask "gcloud-cli"
cask "geekbench"
cask "intellij-idea"
cask "intellij-idea-ce"
cask "iterm2"
cask "kiro"
cask "mactex-no-gui"
cask "microsoft-teams"
cask "mysqlworkbench"
cask "notion-calendar"
cask "obs"
cask "pgadmin4"
cask "postman"
cask "rstudio"
vscode "aishikdalui.expo"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "bufbuild.vscode-buf"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "equimper.react-native-react-redux"
vscode "esbenp.prettier-vscode"
vscode "euskadi31.json-pretty-printer"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "grimmer.vscode-back-forward-button"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "localizely.flutter-intl"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "msjsdiag.vscode-react-native"
vscode "nativebase.nativebase-v3-vscode-extension"
vscode "nickfode.latex-formatter"
vscode "prisma.prisma"
vscode "redhat.java"
vscode "rvest.vs-code-prettier-eslint"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "toba.vsfire"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "webdevsnyc.aws-sam-snippets"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
